# GroupViewSpecificDiffViews Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..GroupViewSpecificDiffViews Property
BuiltInFailures..::..GroupFailures Class See Also
---
You may not create a detail group with view specific elements from different views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GroupViewSpecificDiffViews { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupViewSpecificDiffViews As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GroupViewSpecificDiffViews {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace